[
    {
        "plantId": 1,
        "plantName": "Snake Plant",
        "category": "Air Purifier",
        "price": 18,
        "rating": 4.8,
        "availableStock": 10,
        "careLevel": "Easy",
        "description": "The Snake Plant, scientifically known as Sansevieria, is a strikingly resilient houseplant celebrated for its air-purifying qualities and architectural beauty. Its long, upright leaves, often variegated with shades of green and silver, add a modern touch to any space. This low-maintenance plant thrives in a wide range of conditions, including low light and irregular watering, making it ideal for beginners or those with busy lifestyles. Not only does it filter indoor air by removing toxins, but it also releases oxygen at night, making it a perfect bedroom companion. Place it in a corner of your living room, office, or bedroom for a touch of greenery that requires minimal effort to keep vibrant.",
        "image": "https://myuncommonsliceofsuburbia.com/wp-content/uploads/2023/07/snake-plant-4985304_1280-682x1024.jpg",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 2,
        "plantName": "Fiddle Leaf Fig",
        "category": "Foliage",
        "price": 45,
        "rating": 4.5,
        "availableStock": 5,
        "careLevel": "Medium",
        "description": "The Fiddle Leaf Fig, or Ficus lyrata, is a statement-making houseplant cherished for its large, glossy, violin-shaped leaves that bring a touch of elegance to any interior. This plant’s bold foliage and sculptural form make it a favorite among interior designers and plant enthusiasts alike. It prefers bright, indirect light and consistent care, including regular watering and occasional leaf cleaning to maintain its lustrous appearance. Perfect for a sunny corner in your living room or a stylish office space, the Fiddle Leaf Fig adds a vibrant, tropical vibe. While it requires a bit more attention than low-maintenance plants, its stunning visual impact makes it well worth the effort.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/Bambino_FIddleLeafFIg_3_BB.jpg?v=1641843293",
        "providerName": "Green Haven"
    },
    {
        "plantId": 3,
        "plantName": "Peace Lily",
        "category": "Flowering",
        "price": 25,
        "rating": 4.7,
        "availableStock": 8,
        "careLevel": "Easy",
        "description": "The Peace Lily is a popular indoor plant known for its elegant white blooms and lush green foliage. Despite its delicate appearance, it is remarkably easy to care for, making it perfect for beginners. Peace Lilies thrive in low to medium light and prefer consistently moist soil, though they can tolerate occasional neglect. One of the most appealing features of this plant is its air-purifying properties — it can help remove toxins like benzene and formaldehyde from indoor environments, promoting a healthier living space. The white spathes, which resemble delicate lilies, bloom sporadically throughout the year, adding a touch of serenity and elegance to any room.",
        "image": "https://www.marthastewart.com/thmb/CHYMWYwB0O6vDxL87AlmDBsS-Tw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-1302923231-4ce46b05992648c188531e4579e07829.jpg",
        "providerName": "Nature Nook"
    },
    {
        "plantId": 4,
        "plantName": "Spider Plant",
        "category": "Air Purifier",
        "price": 15,
        "rating": 4.6,
        "availableStock": 12,
        "careLevel": "Easy",
        "description": "The Spider Plant, or Chlorophytum comosum, is a beloved houseplant renowned for its air-purifying abilities and charming, arching leaves that cascade gracefully from its center. Its green and white striped foliage adds a playful yet elegant touch to any space. This plant is incredibly forgiving, thriving in a variety of lighting conditions, from low to bright indirect light, and requiring only moderate watering. Spider Plants are also known for producing 'pups' or baby plants, which can be propagated easily, making them a fun choice for plant enthusiasts. Ideal for hanging baskets, shelves, or as a tabletop centerpiece, this plant is perfect for beginners and seasoned plant lovers alike looking to enhance their indoor air quality.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/Spider_Plant_2.jpg?v=1638987020",
        "providerName": "Leaf & Root"
    },
    {
        "plantId": 5,
        "plantName": "ZZ Plant",
        "category": "Low Light",
        "price": 22,
        "rating": 4.9,
        "availableStock": 6,
        "careLevel": "Low",
        "description": "The ZZ Plant, or Zamioculcas zamiifolia, is a tough and stylish houseplant that’s perfect for those seeking low-maintenance greenery. Its glossy, dark green leaves grow in a rosette pattern, giving it a sleek, modern look that complements any decor. This plant is a champion at tolerating neglect, thriving in low light conditions and requiring infrequent watering—sometimes as little as once a month. Its ability to store water in its rhizomes makes it drought-tolerant, ideal for busy individuals or those new to plant care. Place it in a low-light corner of your home, office, or apartment to add a touch of elegance without the hassle of demanding upkeep.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/ZZplant_3.jpg?v=1640184124",
        "providerName": "Evergreen Supply"
    },
    {
        "plantId": 6,
        "plantName": "Aloe Vera",
        "category": "Succulent",
        "price": 12,
        "rating": 4.4,
        "availableStock": 14,
        "careLevel": "Easy",
        "description": "Aloe Vera is a classic succulent known for its fleshy, serrated leaves filled with a soothing gel that has been used for centuries for its skin-healing properties. Its rosette of thick, green leaves with a hint of gray adds a sculptural element to any space. This plant thrives in bright, indirect light and requires minimal watering, making it perfect for sunny windowsills or well-lit desks. Its drought-tolerant nature means it can go weeks without water, ideal for those with busy schedules. Aloe Vera not only enhances your home’s aesthetic but also serves as a natural first-aid kit, making it a practical and attractive addition to any plant collection.",
        "image": "https://www.marthastewart.com/thmb/ISBH8-66k--kjZv8Urck6ndDt9Y=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/plants-for-your-bedroom-aloe-vera-getty-0323-2000-d844013974734e5b91530b8654e2dabd.jpg",
        "providerName": "BotaniCo"
    },
    {
        "plantId": 7,
        "plantName": "Monstera Deliciosa",
        "category": "Foliage",
        "price": 38,
        "rating": 4.7,
        "availableStock": 7,
        "careLevel": "Medium",
        "description": "The Monstera Deliciosa, often called the Swiss Cheese Plant, is a tropical icon known for its large, heart-shaped leaves with distinctive natural splits and holes. This plant’s bold, jungle-like appearance makes it a stunning focal point in any room, from living spaces to modern offices. It thrives in bright, indirect light and prefers consistently moist but well-drained soil, requiring a bit more attention than low-maintenance plants. With proper care, its leaves grow impressively large, creating a lush, tropical ambiance. Perfect for plant enthusiasts looking to make a bold statement, the Monstera Deliciosa brings a touch of the rainforest to your indoor space.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/Monstera_delisiosa_6_BB.jpg?v=1666996485",
        "providerName": "The Green Corner"
    },
    {
        "plantId": 8,
        "plantName": "Boston Fern",
        "category": "Hanging",
        "price": 20,
        "rating": 4.3,
        "availableStock": 9,
        "careLevel": "Medium",
        "description": "The Boston Fern, or Nephrolepis exaltata, is a lush, feathery houseplant that adds a touch of softness and elegance to any space. Its vibrant green fronds cascade beautifully, making it an ideal choice for hanging baskets, shelves, or elevated plant stands. This fern thrives in humid environments and prefers indirect light, mimicking its natural forest floor habitat. Regular misting and consistent watering keep its foliage vibrant, though it’s forgiving of occasional lapses. Perfect for bathrooms, kitchens, or shaded patios, the Boston Fern brings a refreshing, natural vibe to your home while helping to humidify the air.",
        "image": "https://www.marthastewart.com/thmb/0s3nr9RHuxKY31Ylk2Bn8-MSh7I=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/beautiful-potted-boston-ferns-or-green-lady-houseplant-on-floor-by-brick-wall-in-living-room-1359561042-e5a7f0c464204d85b8e1964ed0d7c670.jpg",
        "providerName": "Leaf & Root"
    },
    {
        "plantId": 9,
        "plantName": "Jade Plant",
        "category": "Succulent",
        "price": 16,
        "rating": 4.5,
        "availableStock": 11,
        "careLevel": "Easy",
        "description": "The Jade Plant, or Crassula ovata, is a charming succulent often associated with good luck and prosperity. Its thick, oval-shaped leaves and sturdy, tree-like structure give it a bonsai-like appearance, making it a delightful addition to desks, windowsills, or tabletops. This plant thrives in bright light and requires infrequent watering, thanks to its ability to store water in its leaves. Its low-maintenance nature makes it perfect for beginners or those seeking a compact yet striking plant. The Jade Plant’s timeless appeal and symbolic meaning make it a thoughtful gift or a stylish accent for any home or office.",
        "image": "https://www.marthastewart.com/thmb/DmJEnIQ3V7jMPFwe6S6xUzrmczM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-2176159438-e815712c53994d388c5209a10579a0fd.jpg",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 10,
        "plantName": "Calathea Orbifolia",
        "category": "Foliage",
        "price": 30,
        "rating": 4.6,
        "availableStock": 4,
        "careLevel": "Medium",
        "description": "The Calathea Orbifolia is a mesmerizing houseplant known for its large, round leaves adorned with delicate, silver-green stripes. This plant’s foliage moves subtly throughout the day, folding up at night and unfurling in the morning, adding a dynamic element to your space. It thrives in medium to bright indirect light and prefers high humidity, making it ideal for bathrooms or kitchens with good airflow. Regular watering and occasional misting keep its leaves vibrant and healthy. Perfect for plant lovers who enjoy a bit of drama in their decor, the Calathea Orbifolia’s bold patterns make it a stunning centerpiece for any indoor jungle.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/Pygmy_Date_Palm_10_BB.jpg?v=1709169549",
        "providerName": "Green Haven"
    },
    {
        "plantId": 11,
        "plantName": "Pothos Golden",
        "category": "Vine",
        "price": 14,
        "rating": 4.8,
        "availableStock": 15,
        "careLevel": "Easy",
        "description": "The Pothos Golden, or Epipremnum aureum, is a versatile and fast-growing houseplant loved for its heart-shaped, variegated leaves that display vibrant green and golden-yellow hues. Its trailing vines make it perfect for hanging baskets, shelves, or as a cascading accent in any room. This plant is incredibly low-maintenance, thriving in low to bright indirect light and requiring watering only when the soil feels dry. Its resilience and ability to adapt to various environments make it a top choice for beginners or anyone looking to add effortless greenery to their space. The Pothos Golden’s lush, trailing growth brings a lively, natural charm to homes and offices alike.",
        "image": "https://www.marthastewart.com/thmb/ybHgvUZOo9nZA-BqUfr8Fa8jPrU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/ms-pothos-hero-marble-queen-getty-96ed7f63d8fe45edb99eceaaa83f886e.jpg",
        "providerName": "Nature Nook"
    },
    {
        "plantId": 12,
        "plantName": "Chinese Evergreen",
        "category": "Air Purifier",
        "price": 19,
        "rating": 4.4,
        "availableStock": 10,
        "careLevel": "Low",
        "description": "The Chinese Evergreen, or Aglaonema, is a stunning and resilient houseplant known for its vibrant, variegated leaves and exceptional air-purifying abilities. Its foliage, often splashed with shades of green, silver, and pink, adds a pop of color to any room. This plant is a fantastic choice for low-light environments, such as offices or shaded corners, and requires minimal care, with watering needed only when the soil is dry to the touch. Its tolerance for neglect and adaptability make it perfect for beginners or those seeking a low-maintenance yet visually striking plant. Place it in a stylish pot to enhance your home’s decor while enjoying cleaner indoor air.",
        "image": "https://cdn.shopify.com/s/files/1/0062/8532/8445/products/CHinese_Evergreen_5_BB.jpg?v=1650297725",
        "providerName": "BotaniCo"
    }
]